; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	thermograph3 - mode
	image0 - mode
	infrared1 - mode
	Star2 - direction
	Star3 - direction
	GroundStation5 - direction
	Star1 - direction
	Star6 - direction
	Star0 - direction
	Star8 - direction
	GroundStation7 - direction
	Star4 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star8)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star6)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Phenomenon9 image0)
	(have_image Star10 thermograph3)
	(have_image Star11 image0)
	(have_image Star12 spectrograph2)
	(have_image Planet13 thermograph3)
	(have_image Star14 thermograph3)
	(have_image Star15 infrared1)
	(have_image Planet16 image0)
	(have_image Phenomenon17 spectrograph2)
	(have_image Phenomenon18 infrared1)
))

)

; plan
1. (turn_to satellite0 star1 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star1)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 star10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star10)
   goals met: 0 of 11
5. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 1 of 11
6. (turn_to satellite0 planet13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet13)
   goals met: 1 of 11
7. (take_image satellite0 planet13 instrument0 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 2 of 11
8. (turn_to satellite0 phenomenon17 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 11
9. (take_image satellite0 phenomenon17 instrument0 spectrograph2)
   added: (have_image phenomenon17 spectrograph2)
   goals met: 3 of 11
10. (turn_to satellite0 star12 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star12)
   goals met: 3 of 11
11. (take_image satellite0 star12 instrument0 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 4 of 11
12. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 4 of 11
13. (take_image satellite0 star14 instrument0 thermograph3)
   added: (have_image star14 thermograph3)
   goals met: 5 of 11
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 11
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 11
16. (turn_to satellite0 star0 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star0)
   goals met: 6 of 11
17. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 6 of 11
18. (turn_to satellite0 phenomenon18 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon18)
   goals met: 5 of 11
19. (take_image satellite0 phenomenon18 instrument1 infrared1)
   added: (have_image phenomenon18 infrared1)
   goals met: 6 of 11
20. (turn_to satellite0 phenomenon9 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 11
21. (take_image satellite0 phenomenon9 instrument1 image0)
   added: (have_image phenomenon9 image0)
   goals met: 7 of 11
22. (turn_to satellite0 planet16 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet16)
   goals met: 7 of 11
23. (take_image satellite0 planet16 instrument1 image0)
   added: (have_image planet16 image0)
   goals met: 8 of 11
24. (turn_to satellite0 star11 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star11)
   goals met: 8 of 11
25. (take_image satellite0 star11 instrument1 image0)
   added: (have_image star11 image0)
   goals met: 9 of 11
26. (turn_to satellite0 star15 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star15)
   goals met: 9 of 11
27. (take_image satellite0 star15 instrument1 infrared1)
   added: (have_image star15 infrared1)
   goals met: 10 of 11
28. (turn_to satellite0 star0 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star0)
   goals met: 11 of 11
